## Pyhton и подключение к БД

*Для выполнения задания Вам представлен датасет с перелётами пассажиров, а также шаблон Jupyter Notebook с переченем задач, которые необходимо выполнить, используя новые навыки, полученные в данной теме. Результат каждого задания должен быть получен посредством выполнения SQL-запроса*

1. Вывести имена всех людей, которые есть в базе данных авиакомпаний

In [54]:
import psycopg2
import sqlalchemy
import pandas as pd

conn = psycopg2.connect(host='localhost',
                        port=5432,
                        dbname='aero_pg',
                        user='postgres',
                        password='1234')
cur=pd.read_sql("SELECT name FROM passenger", conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\3448938757.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur=pd.read_sql("SELECT name FROM passenger", conn)

                    name
0   Bruce Willis
1   George Clooney
2   Kevin Costner
3   Donald Sutherland
4   Jennifer Lopez
5   Ray Liotta
6   Samuel L. Jackson
7   Nikole Kidman
8   Alan Rickman
9   Kurt Russell
10  Harrison Ford
11  Russell Crowe
12  Steve Martin
13  Michael Caine
14  Angelina Jolie
15  Mel Gibson
16  Michael Douglas
17  John Travolta
18  Sylvester Stallone
19  Tommy Lee Jones
20  Catherine Zeta-Jones
21  Antonio Banderas
22  Kim Basinger
23  Sam Neill
24  Gary Oldman
25  Clint Eastwood
26  Brad Pitt
27  Johnny Depp
28  Pierce Brosnan
29  Sean Connery
30  Bruce Willis
31  Mullah Omar

2. Вывести названия всеx авиакомпаний

In [57]:
cur=pd.read_sql("SELECT name FROM company", conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\1938515960.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur=pd.read_sql("SELECT name FROM company", conn)

         name
0  Don_avia
1  Aeroflot
2  Dale_avia
3  air_France
4  British_AW

3. Вывести все рейсы, совершенные из Москвы

In [59]:
cur=pd.read_sql("SELECT * FROM trip WHERE town_from='Moscow'",conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\2349437175.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur=pd.read_sql("SELECT * FROM trip WHERE town_from='Moscow'",conn)

,trip_no,id_comp,plane,town_from,town_to,time_out,time_in
0,1145,2,IL-86,Moscow,Rostov,1900-01-01 09:35:00,1900-01-01 11:23:00
1,1182,1,TU-134,Moscow,Rostov,1900-01-01 12:35:00,1900-01-01 14:30:00
2,1188,1,TU-134,Moscow,Rostov,1900-01-01 22:50:00,1900-01-01 00:48:00
3,1196,1,TU-154,Moscow,Rostov,1900-01-01 04:00:00,1900-01-01 05:45:00

4. Вывести имена людей, которые заканчиваются на "man"

In [26]:
cur=pd.read_sql("SELECT * FROM passenger where name LIKE '%man'",conn)
display(cur)

[]

5. Вывести количество рейсов, совершенных на TU-134

In [60]:
cur=pd.read_sql("SELECT count(*) FROM trip where plane='TU-134'",conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\3457557006.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur=pd.read_sql("SELECT count(*) FROM trip where plane='TU-134'",conn)

   count
0      4

6. Какие компании совершали перелеты на Boeing

In [61]:
cur=pd.read_sql("SELECT comp.name FROM trip JOIN company AS comp ON trip.id_comp=comp.id_comp where plane='Boeing' GROUP by comp.name",conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\3489548833.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur=pd.read_sql("SELECT comp.name FROM trip JOIN company AS comp ON trip.id_comp=comp.id_comp where plane='Boeing' GROUP by comp.name",conn)

         name
0  air_France
1  British_AW

7. Вывести все названия самолётов, на которых можно улететь в Москву (Moscow)

In [32]:
cur=pd.read_sql("SELECT plane FROM trip WHERE town_to='Moscow' group by plane",conn)
display(cur)

[('IL-86     ',), ('TU-134    ',), ('TU-154    ',)]

8. В какие города можно улететь из Парижа (Paris) и сколько времени это займёт?

In [37]:
cur=pd.read_sql("SELECT town_to, (time_in-time_out) FROM trip WHERE town_from='Paris'",conn)
rows = cur.fetchall()
rows

[('Rostov                   ', datetime.timedelta(seconds=12780)),
 ('London                   ', datetime.timedelta(seconds=3600))]

9. Какие компании организуют перелеты из Владивостока (Vladivostok)?

In [79]:
cur=pd.read_sql("SELECT comp.name FROM trip JOIN company AS comp ON trip.id_comp=comp.id_comp where town_from='Vladivostok' GROUP by comp.name", conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\2489461696.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur=pd.read_sql("SELECT comp.name FROM trip JOIN company AS comp ON trip.id_comp=comp.id_comp where town_from='Vladivostok' GROUP by comp.name", conn)

         name
0  Dale_avia

10. Вывести вылеты, совершенные с 10 ч. по 14 ч. 1 января 1900 г.

In [80]:
cur=pd.read_sql("SELECT * FROM trip where time_in between '1900-01-01 10:00:00' AND '1900-01-01 14:00:00' ", conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\246127618.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur=pd.read_sql("SELECT * FROM trip where time_in between '1900-01-01 10:00:00' AND '1900-01-01 14:00:00' ", conn)

,trip_no,id_comp,plane,town_from,town_to,time_out,time_in
0,1101,4,Boeing,Paris,Rostov,1900-01-01 08:12:00,1900-01-01 11:45:00
1,1145,2,IL-86,Moscow,Rostov,1900-01-01 09:35:00,1900-01-01 11:23:00
2,7771,5,Boeing,London,Singapore,1900-01-01 01:00:00,1900-01-01 11:00:00
3,7773,5,Boeing,London,Singapore,1900-01-01 03:00:00,1900-01-01 13:00:00
4,7778,5,Boeing,Singapore,London,1900-01-01 22:00:00,1900-01-01 12:00:00

11. Вывести пассажиров с самым длинным именем

In [62]:
cur=pd.read_sql("SELECT MAX(name) FROM passenger",conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\4252005958.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur=pd.read_sql("SELECT MAX(name) FROM passenger",conn)

                    max
0  Tommy Lee Jones

12. Вывести id и количество пассажиров для всех прошедших полётов

In [63]:
cur = pd.read_sql(
    "select trip_no, count(id_psg) from pass_in_trip group by trip_no", conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\3562729164.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur = pd.read_sql(

    trip_no  count
0      1145      2
1      1181      4
2      1187      2
3      1123      3
4      7772      5
5      7771      6
6      1124      1
7      8882      2
8      1100      1
9      7778      1
10     8881      1
11     7773      1
12     1182      2
13     1188      1

13. Вывести имена людей, у которых есть полный тёзка среди пассажиров

In [66]:
cur = pd.read_sql(
    "SELECT name FROM passenger GROUP BY name HAVING COUNT(*) > 1", conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\2810350853.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur = pd.read_sql(

                   name
0  Bruce Willis

14. В какие города летал Bruce Willis

In [71]:
cur = pd.read_sql(
    "SELECT trip.town_to FROM pass_in_trip JOIN passenger AS pas ON pas.id_psg=pass_in_trip.id_psg  JOIN trip ON trip.trip_no=pass_in_trip.trip_no WHERE pas.name='Bruce Willis'", conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\1826364801.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur = pd.read_sql(

                     town_to
0  Paris
1  Vladivostok
2  Moscow

15. Выведите дату и время прилёта пассажира Стив Мартин (Steve Martin) в Лондон (London)

In [74]:
cur = pd.read_sql(
    "SELECT trip.time_in FROM pass_in_trip JOIN passenger AS pas ON pas.id_psg=pass_in_trip.id_psg  JOIN trip ON trip.trip_no=pass_in_trip.trip_no WHERE pas.name='Steve Martin' AND trip.town_to='London'", conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\2588929671.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur = pd.read_sql(

              time_in
0 1900-01-01 02:00:00

16. Вывести отсортированный по количеству перелетов (по убыванию) и имени (по возрастанию) список пассажиров, совершивших хотя бы 1 полет.

In [78]:
cur = pd.read_sql("SELECT passenger.name, COUNT(pt.place) AS count_place  FROM passenger JOIN pass_in_trip AS pt ON pt.id_psg=passenger.id_psg GROUP BY passenger.name ORDER BY count_place DESC, name ASC", conn)
display(cur)

C:\Users\molot\AppData\Local\Temp\ipykernel_3648\952986624.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cur = pd.read_sql("SELECT passenger.name, COUNT(pt.place) AS count_place  FROM passenger JOIN pass_in_trip AS pt ON pt.id_psg=passenger.id_psg GROUP BY passenger.name ORDER BY count_place DESC, name ASC", conn)

                    name  count_place
0   Michael Caine                   4
1   Mullah Omar                     4
2   Bruce Willis                    3
3   Harrison Ford                   3
4   Jennifer Lopez                  3
5   Kurt Russell                    3
6   Nikole Kidman                   3
7   Kevin Costner                   2
8   Ray Liotta                      2
9   Steve Martin                    2
10  Alan Rickman                    1
11  George Clooney                  1
12  Russell Crowe                   1